import React from 'react';
import './findWordGame.scss'
import GameWrapper from "../gameWrapper";
const classNames = require('classnames');
let timeout;
const allWords = ["год","человек","время","дело","жизнь","день","рука","работа","слово","место","вопрос","лицо","глаз","страна","друг","сторона","дом","случай","ребенок","голова","система","вид","конец","город","часть","женщина","земля","решение","власть","машина","закон","час","образ","отец","история","нога","вода","война","дверь","бог","народ","область","число","голос","группа","жена","процесс","условие","книга","ночь","суд","деньга","уровень","начало","стол","связь","имя","форма","путь","статья","школа","душа","дорога","язык","взгляд","момент","минута","месяц","порядок","цель","муж","помощь","мысль","вечер","орган","рынок","партия","роль","смысл","мама","мера","улица","задача","театр","труд","тело","письмо","центр","утро","мать","комната","семья","сын","смерть","интерес","век","идея","автор","окно","ответ","совет","мужчина","ряд","счет","мнение","цена","точка","план","проект","глава","основа","причина","сердце","рубль","наука","неделя","вещь","чувство","правило","служба","газета","срок","член","ход","стена","плечо","опыт","встреча","принцип","событие","товарищ","объект","очередь","период","состав","пример","лес","девушка","данные","палец","судьба","тип","метод","армия","брат","борьба","шаг","игра","участие","край","размер","номер","район","банк","класс","зал","кровь","позиция","герой","течение","девочка","гость","воздух","мальчик","фильм","договор","регион","выбор","свобода","врач","небо","факт","церковь","завод","фирма","бизнес","союз","деньги","род","команда","спина","дух","музыка","способ","хозяин","поле","доллар","память","природа","дерево","оценка","объем","картина","процент","сцена","анализ","повод","вариант","берег","модель","степень","самолет","телефон","граница","песня","министр","угол","зрение","предмет","двор","солнце","журнал","база","защита","стих","ум","море","удар","знание","солдат","миллион","сон","бумага","реформа","оружие","линия","текст","выход","ребята","магазин","участок","услуга","поэт","желание","пара","успех","среда","возраст","бюджет","площадь","генерал","дочь","понятие","кабинет","фонд","сфера","папа","будущее","продукт","сумма","парень","ветер","помочь","курс","губа","река","грудь","огонь","нос","волос","ухо","радость","сад","доктор","лето","камень","здание","капитан","собака","итог","рис","техника","элемент","деревня","депутат","рот","масса","цвет","рассказ","функция","мужик","лист","звезда","гора","победа","товар","воля","зона","предел","целое","офицер","влияние","цветок","немец","бой","сестра","господь","учитель","многое","рамка","метр","войско","снег","комитет","налог","акт","отдел","карман","вывод","норма","этап","прошлое","фамилия","кухня","доля","пункт","студент","учет","доход","вирус","клетка","теория","враг","бутылка","расчет","го","режим","клуб","попытка","зуб","сеть","семь","прием","боль","кожа","субъект","знак","актер","ресурс","акция","газ","звук","болезнь","детство","мастер","выборы","зима","подход","поиск","коридор","ошибка","лидер","карта","глубина","хлеб","энергия","суть","станция","реакция","десяток","столица","дума","продажа","список","схема","долг","отличие","колено","дед","этаж","секунда","фактор","житель","явление","высота","сосед","усилие","расход","остров","фигура","наличие","дядя","милиция","черт","бабушка","отрасль","слеза","волна","стекло","январь","фраза","декабрь","трубка","храм","стиль","артист","одежда","охрана","водка","кодекс","птица","переход","красота","клиент","толпа","адрес","октябрь","чудо","счастие","улыбка","ужас","аппарат","корабль","родина","черта","тень","апрель","коллега","рыба","кресло","запах","князь","весна","эпоха","занятие","концерт","ладонь","дама","тайна","запад","июнь","беседа","фронт","поезд","баба","музей","судья","зритель","поток","образец","трава","мозг","сотня","лагерь","оборона","честь","кровать","шея","крыша","признак","труба","жертва","беда","фон","ученик","канал","дача","осень","польза","стул","июль","дождь","сутки","еврей","конкурс","лошадь","приказ","реклама","спор","подруга","угроза","вино","костюм","ключ","царь","вкус","лоб","слой","восток","нефть","слух","бок","тюрьма","просьба","подарок","быль","очко","новость","потеря","звонок","кусок","капитал","грех","перевод","партнер","ноябрь","тишина","книжка","мясо","масло","деталь","инженер","оплата","эксперт","кремль","февраль","пьеса","билет","урок","палата","разница","сезон","издание","запас","крик","публика","экран","эффект","ящик","ракета","пакет","зеркало","вес","дно","вагон","тон","щека","дурак","длина","камера","формула","запись","крыло","поездка","колесо","доклад","общение","нож","цифра","полет","стакан","портрет","жилье","корень","смена","кадр","темнота","мост","ремонт","истина","вход","политик","живот","кредит","шум","обед","вершина","серия","кулак","доска","платье","смех","отказ","сбор","пенсия","буква","порог","автобус","полоса","риск","пиво","корпус","штаб","кольцо","постель","выпуск","дворец","брак","печать","автомат","штат","куст","старуха","шутка","съезд","ставка","забота","версия","мешок","контакт","шанс","лодка","заказ","кофе","рубеж","статус","спорт","покой","кризис","взрыв","дым","металл","сапог","диван","почва","лед","минимум","конь","дружба","вина","замок","мечта","сигнал","талант","столик","затрата","золото","миг","плата","подъезд","масштаб","сделка","отдых","тетя","яблоко","чтение","полк","сюжет","потолок","майор","озеро","новое","премия","совесть","дочка","село","танк","ручка","ворота","молоко","еда","сказка","краска","хвост","поворот","москвич","нация","набор","поселок","дыхание","адвокат","сумка","пресса","песок","счастье","мэр","планета","танец","таблица","поэзия","термин","прибыль","восторг","гибель","изделие","темп","уход","молитва","горло","оборот","кость","мина","зал","плеск","шампунь","мирон","жабры","дурень","лыжня","мозель","рядок","индуска","дожим","фенакод","яйла","вилы","чум","крах","тек","гиена","лек","писарь","увар","цунами","сушилка","шпиц","блеф","прибалт","рогач","пенсия","шезлонг","рожь","злоба","росичка","рипус","рыба","муза","тюрк","устрица","держак","кредит","акушер","сенатор","парез","линкор","шлихта","почет","упырь","юнкор","вожак","нимфа","бювар","эскорт","номад","тягач","острица","рыдван","бондарь","осел","харя","тоник","солка","игумен","кюрий","конверт","минор","гувд","прогиб","руда","ампер","жилка","скрап","отделка","токарь","ругание","лейкоз","юпитер","бурсак","браслет","брызгун","рывок","отсыпка","нобиль","специя","истец","кофр","сбор","дракон","навь","ячневик","гуляш","мангуст","кортеж","инула","изверг","нужда","смольня","форс","канцлер","досыпка","охра","шейх","студия","орудие","флокс","гидра","пьеса","седок","хлоп","показ","бюро","флавон","панов","раз","лапти","нельма","бедра","плакун","сенцы","эретизм","барсук","щипач","сводка","ферзь","динар","окисел","анис","дуплет","учан","рыжак","водка","гвардия","гепард","вырезка","талия","ручница","теща","май","орлан","дурочка","тунец","досев","юморист","стек","дубняк","надфиль","кагор","камышит","сап","фонд","кабель","малек","тмин","брелок","экосез","девиз","речь","просек","пот","выпуск","дотация","смотр","сын","конец","мужчина","цветы","оказия","ковер","копал","мездра","каперс","сборка","кость","лен","кознь","люпин","морс","самнит","саквояж","подбел","севок","связь","ливень","орлица","дельфин","ключица","индекс","лещина","лимон","щурка","кровля","лак","стезя","минреп","трусик","японец","выгреб","факолит","ниточка","ниша","миля","верзила","эдем","стужа","люпус","нищета","нутрия","прения","кипрей","грабен","бур","гжель","хлюст","якуты","семянка","победа","сабеизм","голяшка","фирма","река","женушка","шоу","шпатель","умысел","маяк","икарус","наезд","шпулька","бровь","почва","сеточка","кафе","жопа","русофил","омлет","помет","пак","целибат","косьба","надкус","выпот","латынь","вятка","тур","слот","тал","овраг","роба","кроха","каспий","главк","рэп","хрип","швед","бочка","кепи","поэма","приток","форум","слюни","паек","муть","лазер","берзин","куртина","чушка","ультра","вырубка","описка","кальций","хлорит","тропа","джем","прель","сиг","легион","горбуша","вор","недолга","розга","лосина","вычура","прутик","полба","банджо","саенко","мотыга","жаргон","сдоба","беда","фиорд","гейша","сидень","оческа","дунст","подгар","маки","дутар","чайник","контра","грецизм","талон","сераль","ядрица","юрта","литр","гипс","бутса","зерно","пудель","манок","просвет","хадис","штучка","кулон","сушка","олимп","игла","сборище","толкач","букварь","шверт","лоджия","бронхи","поездка","столб","жирянка","чауш","селфи","обкат","отблеск","лопасть","апокриф","лунка","ирга","бирюза","херувим","заход","желудок","дискант","мостик","ваятель","невроз","пух","кивер","эфор","эвфония","пески","гречка","зыряне","шерстка","милорд","чиж","эпос","бидон","любушка","век","часть","чернила","манул","ледник","дружка","тархун","пьеро","род","буги","герой","куплет","бок","скотина","зябь","урод","подлец","лущевка","привес","корвет","лычки","вокзал","сера","овес","лектор","фирн","мясник","думпкар","забег","цукат","пинетка","кирова","щель","вязь","содалит","штабной","спектр","гид","вокал","мудрец","мишарь","салют","скаут","убитый","бинокль","поделка","ваер","затек","роялизм","брынза","байство","мезон","диктор","карт","серпий","дот","парсек","зевок","тыквина","продух","каупер","утроба","мариец","вершина","литорея","холерик","дрофа","битье","кенаф","гринев","термос","чароит","осьмина","кочегар","прямило","куст","обвес","цезий","бомж","люфа","автолиз","ладья","туренок","глухой","курбет","утиль","жакет","добряк","обжин","шина","блок","трель","лайнер","тимберс","лихо","пест","эфа","смех","пескарь","копир","идальго","хаки","певунья","плафон","ночевка","увязка","рис","камзол","колыма","рюмочка","гурия","щелк","лоб","гулько","гранит","ночка","труха","магия","жало","зонтик","плиска","тень","матрос","дьявол","плюска","сверло","убыток","обтеска","румяна","получка","фурма","бедняга","пояс","пуща","вайя","диск","выходец","кресло","лишек","пурген","выделка","морфин","скирда","абсурд","грех","думец","честь","панер","гоньба","том","остин","огпу","туарег","монист","неявка","ничья","детская","разгул","хурма","оладья","септима","кайзер","багрец","дублер","недогар","сноха","рдест","голубка","лужок","швейник","гамлет","зубило","варяг","манто","фига","рона","колит","окание","гусенок","фигурка","адепт","ноябрь","пахит","былинка","василек","акр","тюльпан","ощупь","карсель","кровь","шарлот","обшлаг","нардист","забелин","зона","горлик","шлея","мысок","птицын","цветуха","ловкач","бутафор","джейран","плаун","почки","остяк","сорит","гафель","пастырь","приемка","деньга","риф","струна","спинка","цель","мульча","шамот","кольт","чин","колпица","кров","щелочка","крохаль","бунт","любовь","корн","васин","пилав","кузен","корчи","лезгин","паюс","занос","валяние","ужимка","злодей","лапник","сан","липа","газ","прус","сырть","горелка","хост","мизер","суборь","нажитое","сайт","жбан","дурман","веня","хамит","ягодка","зевота","туз","рафия","таможня","гриф","полчища","гомик","надлом","солея","аозт","фиеста","шерпка","радио","миограф","всадник","ложа","зонд","керогаз","затылок","тканье","ряженка","желоб","зубр","полицай","жавель","торба","оаз","сизаль","чабер","нилотка","буйреп","плахов","время","декан","проект","клюв","брюзга","жилфонд","басок","силуэт","вареник","жир","рать","румпель","указ","сель","шланг","глубина","дофин","балкон","сирень","лунатик","чурбан","шитье","свинуха","час","одурь","путчизм","корнет","речонка","предок","вжатие","анри","штырь","обметка","ведьма","хлорат","рация","фрукт","фунт","позыв","плойка","малышок","сотка","боулинг","братец","мурашев","тон","эдикт","рифма","лифтер","трепак","слойка","мятлик","паж","сачок","львица","напуск","ментол","рацион","пемза","элодея","мопс","мулица","судно","часовня","фактизм","гульба","обувщик","лорнет","плац","щербак","тумблер","наструг","пейсик","паяние","шутник","врач","сальце","разнос","торбан","спилок","дзот","плинтус","спорт","вермут","мыт","макрель","аут","планшир","кульман","удаль","гостья","пушка","барий","вал","рубеж","бюджет","тюфяк","маэстро","петуния","хлорка","сутки","обжинка","увал","гомера","сурепа","смута","сапонит","цирк","увалень","оленуха","прасол","гравий","вираж","индейка","лира","шеврон","платок","медуза","ход","берклий","дары","лицо","этнарх","штихель","иволга","чехол","айсор","отцеп","повытье","артишок","сынишка","сеньора","сон","кунгас","ряпушка","сводник","синьора","венчур","чурек","вьюшка","оракул","марго","тумак","формула","мытник","снятие","ослица","узница","ретушь","узбеки","хилость","фистула","осыпь","планер","реал","блестки","скрип","пресня","износ","серия","гать","бедняки","магистр","хлопец","плюш","оргия","жанр","фойе","мокрица","балет","печаль","эфедрин","комета","этюд","клеш","бювет","разочек","торпеда","хулиган","болт","дягиль","лещадь","шкерт","гибель","сирен","терцина","пломба","эпулис","афоризм","бастион","дощечка","бронх","икры","льдинка","фуганок","сабля","боже","герань","фартук","грузин","дуэлянт","мячик","строй","силомер","харчо","сделка","отрыжка","шило","горчак","надув","крипта","расход","сыпь","наряд","ацтек","удалец","монарх","галифе","весь","суберин","ботаник","мишура","турне","лях","выемка","душечка","бампер","пращник","клоп","выноска","горб","подлиза","стажер","ресница","бег","лафет","жена","стаж","ключ","картуш","побег","ширь","ученица","ищейка","балтиец","мясоед","чулки","тропник","эфир","скоба","зубец","нелюдим","вербняк","кливер","развой","кендырь","синева","беднота","флирт","питер","реалия","бра","пари","потесь","шумовик","шпигат","клипер","наклев","дужка","санкция","лысина","юбилей","оксид","конь","хна","клинтух","сейм","флорида","улица","спазм","гавот","щипец","нора","псих","фехраль","ульч","азур","жулан","побудка","кофейня","просчет","арык","литер","масон","живучка","ветошка","крушина","полка","рытвина","плавщик","армяк","залог","кумыс","пьяница","клозет","отшивка","педфак","бердан","нрав","бадья","застил","лоза","циклон","щеглиха","одежа","умбра","примаж","днепр","богач","выдра","чешка","глас","пружок","бич","типаж","жар","кутеж","радость","мелюзга","зачет","бивень","фасон","стен","вранье","брак","лаки","рознь","лимонад","тарелки","привал","домбра","жердь","булат","втулка","едок","гроза","ляжка","биплан","каре","печка","двучлен","клюз","шпроты","нацизм","выдел","йогурт","дьяк","престиж","орел","истукан","лаг","уздечка","взятие","азурит","братия","кузмич","джейн","блажь","кураж","нудизм","рыбник","юнкер","смоква","блестка","такыр","срам","пуаз","слезы","проза","полцены","осетин","судья","косуля","недосуг","шалфей","ботдек","пилотка","куртаж","немота","гектар","гульден","калибр","хула","филе","гуталин","дельта","перышко","газовик","арбуз","жанрист","чудак","привоз","польза","розыск","плот","якорец","мура","кифоз","округа","всход","кошма","рохля","градус","мажор","плевра","десяток","паря","совмин","гусек","пинок","солярка","сироп","экзарх","пион","ватин","жрица","недожим","пуговка","гладь","глист","объем","блеск","хозяин","серница","плечо","курант","отек","миг","штрек","скот","опашень","слониха","юмор","мартен","депо","гопак","алогизм","спевка","гарт","орбита","банкир","отчим","туф","угонщик","шпрот","жмых","войт","ситар","хлам","шейк","ильм","толк","гнет","меджлис","твин","вымоина","принос","тефлон","село","лорд","фимоз","дуралей","плиоцен","постель","логик","ригель","фацелия","дорн","пульман","рак","поршень","горлан","рольня","корсаж","ходун","светило","дрек","свита","досуг","стопа","кошмар","калиф","ламут","водник","жабник","ять","тунг","обминка","алтей","майор","шухер","меч","лов","чертик","ярмо","вождь","слепота","мокрец","фокус","пловец","гулин","резчица","брульон","кратное","саек","лозняк","хорват","монашек","рабство","шест","бес","зачин","сумерки","зенитка","рисунок","ранец","анурия","буза","лобик","намек","выдумка","отсидка","глория","батог","норд","щорс","грибок","фордек","девка","умник","сленг","клавир","боксит","кружево","кунг","мойщица","упряжка","ломтик","затея","чемпион","низость","усмешка","шпур","тын","экю","плато","муфель","лига","делювий","грелка","фес","лифт","огурец","грызня","йог","змея","уточина","профан","брыла","метан","сказ","повар","штурм","улочка","бред","охабень","сгон","венчик","семга","раклист","кудель","закрой","кайф","иод","гидрант","репняк","овчар","успех","графит","клешня","васькин","обсечка","чируха","нюдист","увертка","блин","тревога","джок","психоз","закром","киста","таежник","семашко","щетина","иканье","пузо","дрожина","дизайн","цеж","надзор","клест","ступень","овца","рыбина","тариф","цук","брат","грудь","мотель","садик","олива","нить","плюха","пленум","гордыня","пыль","выкол","сюртук","агент","сермяга","душевая","синель","утка","бирка","отрыв","вкладыш","тимьян","грудина","выгиб","ельник","тапки","воз","ложки","вабик","навоз","кемпинг","гнейс","пращ","запрос","троица","вещица","кум","заморыш","кремль","токай","двойник","ферязь","ротанг","нихром","пудинг","ядро","пожатие","бронхит","дурачок","овин","шпуля","стека","прядка","свирель","ольха","всхрап","хорист","сода","валет","пик","пустяк","форд","бьеф","чиляга","дуэль","эхин","бредни","спорщик","горин","бяшка","икс","осадки","скерцо","кравчий","наледь","грот","вица","кварцит","фалинь","виола","горелки","алоэ","смерд","десница","казинет","питон","зурнач","дровни","студень","запор","псенок","янки","такси","чувиха","верба","вега","профи","прусак","розалия","грум","джинсы","фиг","семинар","кинозал","рантье","кульбит","дичь","сталкер","басни","причуда","стон","йога","экран","большак","потерна","подиум","литраж","устой","буян","ростбиф","деист","чулан","кембрий","навиток","гонт","овечка","модница","сезам","прованс","аэрон","акрил","ошва","медик","боек","путец","язва","выжиг","обдув","кольца","торс","закут","нарты","диалог","партком","дура","земство","культ","размен","полдник","костер","стан","гусляр","пистон","серв","мойщик","никель","корабел","причет","хорал","смешок","случай","отжиг","гора","лишай","раздел","приезд","моряна","намерзь","абвер","ветчина","пясть","маньяк","теплынь","сев","укосина","ярка","поляна","сабей","пробег","идол","щука","бурат","энзим","сойма","ликтрос","капля","архив","цехин","ярунок","типун","фуэте","втяжка","макияж","смывщик","арго","жига","нок","клен","паск","пучок","кан","ацетон","ключарь","косец","бедуин","батырь","сельва","фита","тлен","бурлеск","зампред","повет","стожар","рулетка","эйфория","силен","пушкина","богема","ручища","руина","плут","изувер","родич","николь","гусли","пуант","тушевка","образ","прялка","юферс","капсюль","взятка","подсев","лохань","скулеж","обличье","шрифт","листва","засев","дар","дрожь","битва","зов","акцент","темп","травля","рений","царство","гниль","кляча","кентавр","свая","норка","латекс","хлыст","плунжер","бромид","паузник","надел","родинка","думпер","дина","стланик","сиделка","казнь","нечисть","пакля","яхта","латины","насып","темь","драп","приют","подушка","тысяча","дерьмо","пригон","арк","велюр","сухова","слиток","злотый","солевар","реванш","дьякон","амулет","тувинец","чемодан","налим","росянка","мыс","трусца","брехня","сонм","сулица","вепрь","сухарь","разбой","роялист","кумач","редис","шалунья","примета","узбечка","герц","ярлык","мухояр","матерь","обряд","синап","вожатый","стеньга","горстка","вона","сервиз","лучина","волюта","бестия","трофей","юкола","псарня","прясло","несушка","офсет","замер","узелок","табун","флаг","спешка","инок","енот","сурик","мак","арболит","серп","дуалист","кровища","чтец","берлина","стерва","эпизод","цена","саз","анид","пройда","афелий","розетка","жерло","купюра","серизна","ляпис","углекоп","курва","гонец","сруб","зыбун","коврига","печурка","экзамен","недруг","мука","охание","торий","торг","ухо","тяга","пастух","айсберг","холера","слежка","грудник","курица","пост","кабинет","автол","зурнист","лор","урюк","зажор","десант","торгаш","напиток","подмен","труба","окулянт","сошка","мяч","спор","дюраль","стол","горжет","персона","рэкет","ант","торги","стена","суржа","фонема","боль","строчка","плов","жертва","горечь","бриг","сюита","ямочка","эльф","оркан","плотник","сопель","футер","тяж","апрель","песо","расцвет","девичья","треба","скрепа","протеин","гран","глухота","бор","мишень","лизунец","пелагия","впуск","бог","нарост","треп","слякоть","стойка","пирог","кампус","пляж","волапюк","потница","токарня","атомщик","тюлька","анкилоз","нотка","постриг","упрямец","санузел","шатер","орлянка","арфист","эротизм","груша","шифр","урочище","чип","резьба","хрящик","бекон","тирс","карп","позер","ганичев","дож","зритель","карбид","хлопки","враг","фаут","знать","рань","минорка","грифон","суд","путник","журнал","микст","нацист","шелк","руль","наплыв","иск","бедуины","бездна","отмывка","отдание","фиат","бордель","сушило","куб","детвора","муцин","устье","мутон","сетка","орден","буровик","кузнец","прямик","вискоза","эпифора","мошник","кадры","посев","колея","высь","призвук","фила","ухарь","клан","киса","рябчик","рудник","белорус","набег","влас","форма","олух","ножка","вотчина","урина","склон","сиданко","палех","матч","приз","гемолиз","резка","лыко","клуня","арест","казуист","жребий","триоль","сдвиг","эльбрус","корсет","лев","слон","буфы","потяжка","боевик","тиролец","фурия","заря","сливняк","дырочка","вычет","садизм","плектр","народ","утес","прок","разбел","фиксаж","раздув","полива","слизняк","порка","аносмия","зуек","миткаль","белица","графин","расчет","балок","бон","мрак","плюшка","ткач","налет","клещи","биограф","прокат","мордаш","ценз","пищевод","мохнач","запрет","слепой","обмен","экзема","греза","дояр","бланк","пернач","фордизм","радист","сваебой","шунгит","клумба","фал","шкот","митенка","шленка","шагомер","щур","линька","хром","оценщик","клуб","эпика","жмурки","вагон","вязание","приязнь","спинет","злаки","барин","иго","урон","гроздь","дело","эсквайр","улан","бас","намет","элегист","клад","сливка","хрущак","станок","кино","чувак","колумб","ковыль","атеизм","госдума","песок","отвал","главреж","ноша","упрек","выгонка","кнехт","альбом","атомник","зубрило","плюс","лягание","клир","талер","стреха","опарник","пылинка","усталь","русинка","лагерь","мера","триплан","сотня","духан","повеса","факт","фильтр","терлик","рожа","феод","гуляние","полати","гренки","топсель","пулька","яма","купаж","крат","битумы","бусина","мелочь","хлопчик","сектор","фагот","корытце","улика","диабет","чаяние","формат","очинка","цветник","мотылек","понева","зенки","лунь","цвет","кобза","бокс","житье","спицын","олифа","яства","борть","лобзик","эполет","плитняк","нардек","старец","векшин","ушивка","чир","избыток","мост","гряда","брюхо","йота","фуговка","пах","гаврик","плетка","праязык","тыловик","заводь","кулинар","функция","виньет","регбист","лайм","плева","секущая","желатин","жнец","литфонд","сорт","гвоздик","дорубка","конура","гофр","блоха","вершок","турок","форпик","пекарня","румба","догмат","минус","хрия","желток","приматы","апогей","сом","венгр","лесть","пас","зигота","писец","март","надпил","отсылка","бура","муэдзин","крона","реплика","капут","течка","пикша","съезд","кератин","двойка","чуня","шваб","сутаж","муштра","посыл","шпорец","софа","синяк","бачок","грызун","утор","граф","иман","бриошь","вздох","твиндек","пирога","мойка","силь","пена","ремиз","клот","анемия","одышка","просинь","послед","комар","понятие","фенотип","серко","гит","тишь","подсчет","зацеп","весло","кручина","дикарь","ядозуб","рыбешка","верига","теургия","ландыш","година","мусор","рамщик","ушко","служка","столбец","воин","яшма","кутора","янтарь","хлор","пятница","купель","топшур","стяг","кубань","рубщик","настил","сипай","гайдроп","свора","куш","хит","суша","угар","фенол","зеркало","горка","бродяга","хоры","сума","девушка","укание","пикетаж","трюк","водянка","склерон","борщ","ферма","септуор","сырец","фидель","трояк","мазер","сень","побелка","сиамец","сменщик","гирло","новик","юноша","кузня","линовка","сатин","пират","пенс","югурт","рейд","трек","дебаты","стригун","левкой","паз","чуб","нация","пилот","мыщелка","фантом","самолюб","волан","объятие","леность","выброс","зуда","дворик","хорек","неолит","газпром","вес","свайщик","йотация","кворум","пугач","вена","дверка","калий","иуда","парень","ошибка","штрих","пожар","булка","компас","метро","дежа","сбег","трепка","тряпка","часы","урок","кеш","голик","идеал","месиво","салинг","грильяж","тапер","фланец","кот","холмс","аист","фреон","щелчок","кодла","чувяк","дафния","кубанец","дом","милый","картон","отсек","эвклаз","комбат","деспот","мышка","повал","кубизм","посул","отдел","фура","риска","рулена","звонарь","сырок","оплетка","чизель","пудрет","кочан","заступ","счеты","кляп","шторм","притон","било","углерод","звук","лар","туш","китаец","нарсуд","гольмий","стремя","окунь","ярок","рвота","цензура","триодь","смалец","хамсин","зодиак","твердо","центр","смывка","лонгет","лень","прочес","натр","ящик","ров","курья","веда","сходка","среда","эротика","ювелир","киот","наигрыш","люмпен","патер","свекла","ломик","княжич","отзвук","планшет","желтуха","полька","герб","одр","зяблик","дебри","ябедник","краля","муфлон","пиявка","изюм","троп","блюдо","поилка","пьеза","шевро","врезка","бязь","святоша","риза","нарыв","портье","резак","купидон","слепун","елка","кал","товар","бодание","онагр","духовик","тип","минер","майонез","пакет","дупло","кобальт","ботва","болван","жираф","копье","кедрач","квестор","рольщик","рубанок","жемчуг","неясыть","шрот","жизнь","рубль","пудра","словарь","эклер","вертлуг","дутыш","слухач","горбун","опилка","чесотка","салоп","фазис","створ","тепло","бурт","царизм","нубийка","ость","трюизм","зет","доступ","буревал","пленэр","нелюди","горсть","копь","трешка","брючки","заросль","цукание","привкус","ромб","сапер","охват","лидер","буряты","дек","вашгерд","выпь","мистер","лакей","эмаль","тираж","делянка","мошна","телок","обрат","буря","слип","корда","весна","рутений","гурт","пружина","летчик","речник","силур","присев","плица","ребятки","курд","выборка","анус","тальник","хмель","обстрел","камень","тябло","эстамп","блиндаж","доспех","простак","слоган","крап","кит","кил","давило","обуза","ратин","стилка","олеандр","холуй","бемоль","маятник","нива","дебют","пшеница","бел","навой","сжим","пряха","хавбек","адряс","след","деляга","лазурит","трагик","уголья","бегунья","пугание","отрасль","брешь","опак","маховик","сцепщик","нефрит","бревно","икромет","эскалоп","залп","памир","духота","пасть","ночь","объезд","вещь","опий","капер","лесок","нутро","стер","спрей","принц","ретина","тако","важ","аудитор","шкафут","менгир","корунд","маляр","адрес","понг","выем","скряга","событие","сеть","кожух","подвиг","томпак","подвал","лангуст","синь","брюнет","отъемыш","бола","оливка","кастор","адуляр","снобизм","плис","штора","штопка","бай","празем","отчизна","сноб","комбайн","депорт","думка","опус","бушприт","джига","клепань","гурда","цитра","песня","роульс","нектар","излом","догма","разок","фуксин","цех","пряник","дичок","пьянка","мазик","штаг","завком","ушиб","шкив","грыжа","гурьба","буж","студиец","дуплекс","пай","финт","доза","дежкин","цикута","колье","анекдот","копыл","калуфер","школа","ломбер","задок","ряса","офицер","клоун","дыня","деталь","битлз","курс","тяжба","гоблин","пеонаж","овация","молва","кобель","кенотаф","атом","минутка","мышь","бивак","тенор","алжирец","шпионаж","шхуна","согдиец","бутырки","слега","нагул","подать","жнейка","спальня","воришка","калин","метлика","чека","ветла","пятачок","локаут","холмик","утреня","френч","отец","валик","вектор","расплод","торф","щипцы","стекло","мирянка","деистка","урна","бодяга","вкус","шарф","браток","дресва","муляж","кряж","ногаец","сорбит","скрипач","туер","жвачные","эластин","хвоя","тюбинг","криз","вояж","трус","пята","навет","сила","юфть","огневик","форинт","змей","рабыня","толща","дырка","целина","служба","клипс","часик","асцит","хакер","рощица","плоть","мангль","блинт","декабрь","ланкорд","жилье","феска","сударь","розлив","демос","тире","пьекса","осек","перкаль","прыть","съем","просьба","разлет","орфизм","сыта","олеум","подмес","флакон","дувал","спирея","брусья","тайфун","рынок","садок","дружище","шинель","омар","мисюрка","флажок","жостер","пурка","огурчик","обвал","трагизм","жадеит","аншлюс","кран","армия","юань","скарб","клич","урка","шкало","прелюд","кило","телка","шримс","жим","круп","пискун","слых","аэробус","горец","ступа","этуаль","рюха","туфли","утопизм","спина","куга","дюны","лентяй","башкир","зельц","ледоруб","бут","задник","сирена","горесть","бек","цезарь","холст","хлястик","мультик","мигрень","сагиб","октаэдр","биндюг","люкс","ленч","мотыль","зондаж","рудольф","сушняк","лучок","кубист","тина","риск","лодырь","налой","низка","кроль","поле","игра","лошадь","август","гребля","видео","сальто","синюха","ряска","пиар","тифдрук","хроник","треска","верша","межа","кюрин","аспект","верк","редан","шутница","обитель","мгла","стелька","дротик","земляк","капитул","дюйм","сыч","гяур","крылан","лик","коза","сад","стояние","фиброз","обжимка","рей","эстонка","филер","дюбек","грабли","чернова","внучек","лодыжка","беляна","чаус","петушок","кетчуп","жалюзи","ибер","нотабль","чех","медяк","двор","рябь","триумф","вика","смена","земщина","минута","танец","грозд","мари","улитка","рояль","гнома","косица","гений","ведун","авеню","рыбак","черт","храм","допинг","дерюга","тюркос","сэндвич","спайщик","дольмен","магний","дрезина","сакля","узик","менуэт","терн","фильц","горнист","жинка","лимб","микрон","педаль","рысенок","вирша","окрас","элегия","ведьмин","сбитень","обвязка","обрытие","лаж","полдень","кудри","пинцет","буран","филарх","гаденыш","чистюля","кода","нукер","храп","свинья","луна","нотация","абрис","порубка","плен","шнурок","фат","ягуар","стирка","каприс","свайник","стернь","скена","косарь","вертлюг","сырье","звание","уанстеп","супонь","газик","дрожки","меринос","чабрец","пробел","этруска","деточка","плутон","русак","моржиха","спич","пища","козырь","бантик","икота","пивко","жуть","зверюга","ходьба","экватор","сейид","племя","наркоз","ахинея","чаек","азия","кирха","ставня","этимон","колчан","флюс","шпажник","танцор","вытчик","мальбек","темляк","щуп","присед","москвич","сенат","ливр","шкаф","лог","выгул","штос","пирс","вестник","действо","трисель","топчан","вакулин","штольня","фут","ордынец","стенка","прекос","банщик","литвак","отгул","торец","резинка","ритуал","синай","уран","егоза","лихость","бедный","неф","престол","залежь","мат","белки","каплун","змий","кисет","золушка","взброс","арлекин","ситро","загорск","эпигон","шуровка","страз","взгляд","помета","шабот","осман","народец","рыло","луг","мушкет","треск","порезка","отписка","постав","полк","диафон","изгой","ладо","желна","леска","сыродел","крыша","обхват","биокрем","штыка","кресало","бей","гроб","бюретка","ракия","пыжьян","граб","циперус","кий","гонщица","пульт","сурепка","вено","сопли","гридень","рыкание","сапог","досье","сход","ложбина","мужик","досушка","комель","шибер","вьюн","сельмаг","ятовье","ступня","мартын","неофит","прилов","малый","выбоина","аул","шажок","чаевод","голиаф","полушар","слог","орт","глянец","шепот","подгиб","пейс","холка","таец","взгорье","стая","грызло","носуха","вина","тройка","спидвей","продув","требник","цедра","старье","тягло","гипюр","трахея","ков","суданец","марево","поруб","бойня","крыло","туесок","мета","привязь","кина","трос","драчун","трагус","элитра","щеточка","иена","юнга","тешка","луидор","фасет","вуаль","ночлег","коряга","туника","уток","сало","партиец","трельяж","степняк","инвар","морзист","парик","правнук"];

function getRandomWords(length) {
    let words = [];
    while(words.length < length){
        let word = allWords[Math.floor(Math.random()*allWords.length)];
        if(!words.includes(word)){
            words.push(word)
        }
    }
    return words;
}
class FindWordGame extends GameWrapper {
    selectedMode = false;
    rounds = this.props.levelInfo.rounds;
    wordsAmount = this.props.levelInfo.wordsAmount;
    rows = this.props.levelInfo.rowsLength;
    componentWillUnmount() {
        clearTimeout(timeout);
        this.clearTimer();
    }

    constructor(props) {
        super(props);
        const [words, answers, findWords] =
            getFillWordAndPlacesWords(this.wordsAmount, this.rows);
        this.state = {
            arrWords: words,
            rightAnswersWords: answers,
            words: findWords,
            doneCells: [],
            doneWords: [],
            selectedCells: [],
            timer: props.levelInfo.sec,
            isWin: false,
            round: 1
        };
        if(this.state.timer){
            this.setTimer();
        }
    }
    startRound() {
        this.mistakes = 0;
        timeout = setTimeout(() => {
            let round = this.state.round;
            if(round === this.rounds) {
                return this.props.getWin();
            }
            const [words, answers, findWords] =
                getFillWordAndPlacesWords(this.wordsAmount, this.rows);
            this.answers = answers;
            this.setState({
                arrWords: words,
                words: findWords,
                doneWords: [],
                doneCells: [],
                selectedCells: [],
                rightAnswersWords: answers,
                rightLetters: [],
                round: round + 1
            });
        }, 300);
    }

    testWord() {
        let word = '';
        let selectedCells = this.state.selectedCells;
        for(let i = 0; i < selectedCells.length; i++){
            let xy = selectedCells[i].split('-');
            let x = Number(xy[0]);
            let y = Number(xy[1]);
            word += this.state.arrWords[x][y];
        }
        word = word.toLowerCase();
        if (this.state.words.includes(word)) {
            let places = this.state.rightAnswersWords[word];
            for (let i = 0; i < selectedCells.length; i++) {
                this.setState({selectedCells: []});
                this.selectedMode = false;
                if(places[i] !== selectedCells[i]) return false;
            }
            let doneCells = [...this.state.doneCells, ...selectedCells];
            let doneWords = [...this.state.doneWords];
            doneWords.push(word);
            if(doneWords.length === this.state.words.length){
                timeout = setTimeout(()=>{
                    this.startRound();
                }, 200)
            }
            this.setState((state)=>({
                doneWords,
                doneCells
            }));
        }
        this.setState({selectedCells: []});
        this.selectedMode = false;
    };

    selectFirstCell(i, j) {
        const cell = i + '-' + j;
        if (this.state.doneCells.includes(cell)) return;
        if (!this.selectedMode) {
            this.addSelectedCell(i, j);
            this.selectedMode = true;
        }
    }

    selectFirstCellPhone(e, i, j) {
        if (e.touches.length === 1) {
            if (e.cancelable) {
                e.preventDefault();
            }
            this.selectFirstCell(i, j);
        }
    }
    addSelectedCell(i, j){
        let selectedCells = [...this.state.selectedCells];
        let cell = i + '-' + j;
        if(!selectedCells.includes(cell)){
            selectedCells.push(cell);
            this.setState({
                selectedCells
            })
        }
    }

    selectNextCell(i, j){
        const cell = i + '-' + j;
        if(this.state.doneCells.includes(cell)) return;
        if(this.selectedMode){
            let selectedCells = [...this.state.selectedCells];
            if (selectedCells.includes(cell)){
                let indexEl = selectedCells.indexOf(cell);
                if(indexEl !== selectedCells.length -1){
                    selectedCells = selectedCells.slice(0, indexEl+1);
                    this.setState({
                        selectedCells
                    });
                }
            }else{
                let xy = selectedCells[selectedCells.length-1].split('-');
                let x = Number(xy[0]);
                let y = Number(xy[1]);
                if((i - 1 === x && j === y) ||
                    (i + 1 === x && j === y) ||
                    (j + 1 === y && i === x) ||
                    (j - 1 === y && i === x) )
                {
                    this.addSelectedCell(i, j)
                }
            }

        }
    }
    selectNextCellPhone(e){
        if(e.touches.length === 1){
            if(e.cancelable){
                e.preventDefault();
            }
            let x=e.touches[0].clientX;
            let y=e.touches[0].clientY;
            let el = document.elementFromPoint(x, y);
            if(el && el.classList.contains('findWord__cell')){
                el.click();
            }

        }
    }

    finishSelectCells() {
        this.testWord();
    }

    render() {
        return (
             <div className={'findWord-game'} onTouchEnd={()=>this.finishSelectCells()} onMouseUp={()=>this.finishSelectCells()}>
                 <div className="game-page__flex">
                     <div className="game-page__rounds">Этап: {this.state.round}/{this.props.levelInfo.rounds}</div>
                     {this.state.timer ? <div className="timer">Время: {this.state.timer}</div> : ''}
                 </div>
                 <div className="findWord-game__done-words">
                     {this.state.words.map((word)=>{
                         return <span
                             key={word}
                         className={this.state.doneWords.includes(word) ? 'findWords__done-word' : ''}
                         >{word} </span>
                     })}
                 </div>
                <table className="findWord__field">
                    <tbody>
                    {
                        this.state.arrWords.map((row, rowIndex) =>
                            <tr key={'row' + rowIndex}>
                                {row.map((letter, colIndex) =>
                                    <td
                                        key={'col'+ rowIndex+'-'+colIndex}
                                        className={
                                            classNames({
                                                'findWord__cell': true,
                                                'findWord__cell_selected': this.state.selectedCells.includes(rowIndex + '-' + colIndex),
                                                'findWord__cell_done': this.state.doneCells.includes(rowIndex + '-' + colIndex)
                                            })
                                        }

                                        onMouseDown={()=>this.selectFirstCell(rowIndex, colIndex)}
                                        onTouchStart={(e)=>this.selectFirstCellPhone(e, rowIndex, colIndex)}

                                        onMouseOver={()=>this.selectNextCell(rowIndex, colIndex)}
                                        onTouchMove={(e)=>this.selectNextCellPhone(e)}
                                        onClick={()=>this.selectNextCell(rowIndex, colIndex)}
                                    >
                                        {letter}
                                    </td>
                                )}
                            </tr>
                        )
                    }
                    </tbody>
                </table>
            </div>

        );
    }

}

export default FindWordGame;

let arr_RU = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ы', 'Ъ', 'Э', 'Ю', 'Я'];

function getFillWordAndPlacesWords(wordsLength, height) {
    try{
        let wordArray = getRandomWords(wordsLength);
        let fillWord = [];
        for (let i = 0; i < height; i++) {
            fillWord[i] = [];
            for (let j = 0; j < 6; j++) {
                fillWord[i].push(0);
            }
        }
        let allPlacesWords = {};
        for (let i = 0; i < wordArray.length; i++) {
            let arr = getWordsInArrAndPlaces(wordArray[i], fillWord);
            fillWord = arr[0];
            allPlacesWords[wordArray[i]] = arr[1];
        }
        //Заполнить буквы вокруг букв слов
        let letters = [];
        for (let i = 0; i < fillWord.length; i++) {
            for (let j = 0; j < fillWord[0].length; j++) {
                if (fillWord[i][j] !== 0) {
                    let arr_RU = ['А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й', 'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ', 'Ь', 'Ы', 'Ъ', 'Э', 'Ю', 'Я'];
                    let deleteArr = [];
                    if (i !== 0) deleteArr.push(fillWord[i - 1][j]);
                    if (i !== fillWord.length - 1) deleteArr.push(fillWord[i + 1][j]);
                    if (j !== 0) deleteArr.push(fillWord[i][j - 1]);
                    if (j !== fillWord[0].length - 1) deleteArr.push(fillWord[i][j + 1]);
                    for(let i = 0; i < deleteArr.length; i++) {
                        if (isNaN(deleteArr[i])) {
                            arr_RU.splice(arr_RU.indexOf(deleteArr[i]), 1);
                        }
                    }
                    if (i !== 0 && fillWord[i - 1][j] === 0) {
                        letters.push([i - 1, j, arr_RU[Math.floor(Math.random() * arr_RU.length)].toUpperCase()]);
                    }
                    if (i !== fillWord.length - 1 && fillWord[i + 1][j] === 0) {
                        letters.push([i + 1, j, arr_RU[Math.floor(Math.random() * arr_RU.length)].toUpperCase()]);
                    }
                    if (j !== fillWord[0].length - 1 && fillWord[i][j + 1] === 0) {
                        letters.push([i, j + 1, arr_RU[Math.floor(Math.random() * arr_RU.length)].toUpperCase()]);
                    }
                    if (j !== 0 && fillWord[i][j - 1] === 0) {
                        letters.push([i, j - 1, arr_RU[Math.floor(Math.random() * arr_RU.length)].toUpperCase()]);
                    }
                }
            }
        }
        for (let i = 0; i < letters.length; i++) {
            fillWord[letters[i][0]][letters[i][1]] = letters[i][2];
        }
        //Заполнить оставшиеся клетки случайными буквами
        for (let i = 0; i < fillWord.length; i++) {
            for (let j = 0; j < fillWord[0].length; j++) {
                if (fillWord[i][j] === 0) {
                    fillWord[i][j] = arr_RU[Math.floor(Math.random() * arr_RU.length)].toUpperCase();
                }
            }
        }
        return [fillWord, allPlacesWords, wordArray];
    }catch (ignored){
        return getFillWordAndPlacesWords(wordsLength, height);
    }

}

function getWordsInArrAndPlaces(word, arr) {
    let emptyCells = getAllEmptyCells(arr);
    word = word.toUpperCase();
    let copyArr = [];
    for (let i = 0; i < arr.length; i++) {
        copyArr.push(arr[i].slice(0));
    }
    let startCell = emptyCells[Math.floor(Math.random() * emptyCells.length)];
    //Выбираем направление слова
    // 0 - вверх; 1 - вправо; 2 - вниз; 3 - влево
    let thatRow = startCell[0];
    let thatCol = startCell[1];

    copyArr[thatRow][thatCol] = word[0];
    let placesLetters = [];
    placesLetters.push(thatRow + '-' + thatCol);
    for (let i = 1; i < word.length; i++) {
        let directions = [0, 1, 2, 3];
        let isLetterInCell = false;
        for (let q = 0; q < 4; q++) {
            let rand = Math.floor(Math.random() * directions.length);
            let randDirection = directions[rand];
            directions.splice(rand, 1);
            if (randDirection === 0) {
                if (thatRow !== 0 && copyArr[thatRow - 1][thatCol] === 0) {
                    copyArr[thatRow - 1][thatCol] = word[i];
                    thatRow--;
                    isLetterInCell = true;
                    break;
                }
            } else if (randDirection === 1) {
                if ((thatCol !== copyArr[0].length - 1) && copyArr[thatRow][thatCol + 1] === 0) {
                    copyArr[thatRow][thatCol + 1] = word[i];
                    thatCol++;
                    isLetterInCell = true;
                    break;
                }
            } else if (randDirection === 2) {
                if ((thatRow !== copyArr.length - 1) && copyArr[thatRow + 1][thatCol] === 0) {
                    copyArr[thatRow + 1][thatCol] = word[i];
                    thatRow++;
                    isLetterInCell = true;
                    break;
                }
            } else {
                if ((thatCol !== 0) && copyArr[thatRow][thatCol - 1] === 0) {
                    copyArr[thatRow][thatCol - 1] = word[i];
                    thatCol--;
                    isLetterInCell = true;
                    break;
                }
            }
        }
        placesLetters.push(thatRow + '-' + thatCol);
        if (!isLetterInCell) {
            return getWordsInArrAndPlaces(word, arr);
        }
    }
    return [copyArr, placesLetters];
}

function getAllEmptyCells(arr) {
    //Получить массив незанятых ячеек (нет буквы)
    let emptyCells = [];
    for (let i = 0; i < arr.length; i++) {
        for (let j = 0; j < arr[0].length; j++) {
            if (arr[i][j] === 0) {
                emptyCells.push([i, j]);
            }
        }
    }
    return emptyCells;
}